---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RevitLinkType..::..Create Method
RevitLinkType Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ExternalResourceReference, RevitLinkOptions) | Creates a new Revit link type from an external resource reference and loads the linked document. |
|  | Create(Document, ModelPath, RevitLinkOptions) | Creates a new Revit link type and loads the linked document. |

# See Also

RevitLinkType Class

RevitLinkType Members

Autodesk.Revit.DB Namespace